In [ ]:
import pandas as pd
import matplotlib.pyplot as plt


df = pd.read_csv('D:\Lexicon_Labs\Machine_Learning\Files_Day_2\messy_data.csv')
df

   id    age  height  weight   income purchases   gender
0   1   25.0   175.0      68  35000.0  23,45,12     male
1   2    NaN   182.0      80  42000.0    34,,19   female
2   3  150.0   165.0     180  28000.0       NaN  unknown
3   4   34.0   168.0      70      NaN    ,55,67     male
4   5   29.0   190.0     165  31000.0  12,19,23   female
5   6   42.0     NaN      82  37000.0  40,41,42     male
6   7    NaN   -99.0     190      NaN      23,,   female
7   8   38.0   172.0      75  39000.0     22,20  unknown
8   9   44.0   180.0     160  41000.0       NaN     male
9  10   33.0   160.0     130      0.0  14,13,12    other

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         10 non-null     int64
 1   age        8 non-null      float64
 2   height     9 non-null      float64
 3   weight     10 non-null     int64
 4   income     8 non-null      float64
 5   purchases  8 non-null      object
 6   gender     10 non-null     object
dtypes: float64(3), int64(2), object(2)
memory usage: 692.0+ bytes

In [6]:
df.describe()

             id       age      height      weight        income
count  10.00000    8.0000    9.000000   10.000000      8.000000
mean    5.50000   49.3750  143.666667  120.000000  31625.000000
std     3.02765   41.1476   91.461741   49.997778  13647.998283
min     1.00000   25.0000  -99.000000   68.000000      0.000000
25%     3.25000   32.0000  165.000000   76.250000  30250.000000
50%     5.50000   36.0000  172.000000  106.000000  36000.000000
75%     7.75000   42.5000  180.000000  163.750000  39500.000000
max    10.00000  150.0000  190.000000  190.000000  42000.000000

In [7]:
df.head(10)

   id    age  height  weight   income purchases   gender
0   1   25.0   175.0      68  35000.0  23,45,12     male
1   2    NaN   182.0      80  42000.0    34,,19   female
2   3  150.0   165.0     180  28000.0       NaN  unknown
3   4   34.0   168.0      70      NaN    ,55,67     male
4   5   29.0   190.0     165  31000.0  12,19,23   female
5   6   42.0     NaN      82  37000.0  40,41,42     male
6   7    NaN   -99.0     190      NaN      23,,   female
7   8   38.0   172.0      75  39000.0     22,20  unknown
8   9   44.0   180.0     160  41000.0       NaN     male
9  10   33.0   160.0     130      0.0  14,13,12    other

In [8]:
#Convert age to numeric
df['age'] = pd.to_numeric(df['age'], errors='coerce')

In [9]:
#unrealistic ages
df.loc[(df['age'] < 0) | (df['age'] > 120), 'age'] = pd.NA

In [ ]:
#Fill missing age with median
median_age = df['age'].median()
df['age'] = df['age'].fillna(median_age)

In [10]:
#Height must be positive

#Fix missing and placeholder values

#Decisions

#-99 is an invalid placeholder

#Height ≤ 0 → missing

#Missing → fill with median height

df['height'] = pd.to_numeric(df['height'], errors='coerce') #Convert to numeric
df.loc[df['height'] <= 0, 'height'] = pd.NA   #Remove invalid heights
#Fill missing height
median_height = df['height'].median()
df['height'] = df['height'].fillna(median_height)
df['height'].describe()

count     10.000000
mean     173.900000
std        8.656404
min      160.000000
25%      169.000000
50%      173.500000
75%      178.750000
max      190.000000
Name: height, dtype: float64

In [11]:
# Handle missing income

# Decide what to do with 0

# Decision (simple and defensible)

# Blank income → missing

# 0 → treated as missing (likely placeholder)

# Fill with median income

#Convert to numeric
df['income'] = pd.to_numeric(df['income'], errors='coerce')

#Treat 0 as missing
df.loc[df['income'] == 0, 'income'] = pd.NA

#Fill missing income
median_income = df['income'].median()
df['income'] = df['income'].fillna(median_income)

df['income'].describe()

count       10.000000
mean     36400.000000
std       4247.875286
min      28000.000000
25%      35500.000000
50%      37000.000000
75%      38500.000000
max      42000.000000
Name: income, dtype: float64

In [12]:
def clean_purchases(x):
    if pd.isna(x) or x == "":
        return [0]
    items = x.split(',')
    cleaned = []
    for item in items:
        if item.strip() == "":
            cleaned.append(0)
        else:
            cleaned.append(int(item))
    return cleaned

In [13]:
df['purchases'] = df['purchases'].apply(clean_purchases)
df['purchases'].head()

0    [23, 45, 12]
1     [34, 0, 19]
2             [0]
3     [0, 55, 67]
4    [12, 19, 23]
Name: purchases, dtype: object

In [14]:
df = pd.get_dummies(df, columns=['gender'])

In [15]:
cols_to_normalize = ['height', 'weight', 'income']

for col in cols_to_normalize:
    df[col] = (df[col] - df[col].min()) / (df[col].max() - df[col].min())

In [ ]:
df.to_csv("D:\Lexicon_Labs\Machine_Learning\Files_Day_2\cleaned_data.csv", index=False)

In [18]:
df_cleaned = pd.read_csv('D:\Lexicon_Labs\Machine_Learning\Files_Day_2\cleaned_data.csv')
df_cleaned

,id,age,height,weight,income,purchases,gender_female,gender_male,gender_other,gender_unknown
0,1,25.0,0.500000,0.000000,0.500000,"[23, 45, 12]",False,True,False,False
1,2,NaN,0.733333,0.098361,1.000000,"[34, 0, 19]",True,False,False,False
2,3,NaN,0.166667,0.918033,0.000000,[0],False,False,False,True
3,4,34.0,0.266667,0.016393,0.642857,"[0, 55, 67]",False,True,False,False
4,5,29.0,1.000000,0.795082,0.214286,"[12, 19, 23]",True,False,False,False
5,6,42.0,0.450000,0.114754,0.642857,"[40, 41, 42]",False,True,False,False
6,7,NaN,0.450000,1.000000,0.642857,"[23, 0, 0]",True,False,False,False
7,8,38.0,0.400000,0.057377,0.785714,"[22, 20]",False,False,False,True
8,9,44.0,0.666667,0.754098,0.928571,[0],False,True,False,False
9,10,33.0,0.000000,0.508197,0.642857,"[14, 13, 12]",False,False,True,False